Dataset/All/data/swarm-mm-wrk-compose-c6525-25g-exp15-havail1-hori1-verti1-infi1-client1-t8-c512-d30-R1500-N1
Using argument nginx
using  args: threads=8 and connections=512 and duration=30 and requests=1500
Running 30s test @ http://10.10.1.4:8080/wrk2-api/user-timeline/read
  8 threads and 512 connections
  Thread calibration: mean lat.: 4133.344ms, rate sampling interval: 14303ms
  Thread calibration: mean lat.: 4073.726ms, rate sampling interval: 14360ms
  Thread calibration: mean lat.: 4111.312ms, rate sampling interval: 14639ms
  Thread calibration: mean lat.: 4046.631ms, rate sampling interval: 13819ms
  Thread calibration: mean lat.: 4115.984ms, rate sampling interval: 14573ms
  Thread calibration: mean lat.: 4081.827ms, rate sampling interval: 14229ms
  Thread calibration: mean lat.: 3954.985ms, rate sampling interval: 14163ms
  Thread calibration: mean lat.: 4092.574ms, rate sampling interval: 14385ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    15.14s     4.55s   24.05s    59.99%
    Req/Sec    44.38      0.70    45.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.05s 
 75.000%   18.87s 
 90.000%   21.36s 
 99.000%   24.05s 
 99.900%   25.40s 
 99.990%   25.77s 
 99.999%   26.25s 
100.000%   26.25s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3928.063     0.000000            1         1.00
    9117.695     0.100000          717         1.11
   10592.255     0.200000         1433         1.25
   12075.007     0.300000         2149         1.43
   13516.799     0.400000         2864         1.67
   15048.703     0.500000         3584         2.00
   15810.559     0.550000         3943         2.22
   16539.647     0.600000         4295         2.50
   17334.271     0.650000         4656         2.86
   18071.551     0.700000         5013         3.33
   18874.367     0.750000         5370         4.00
   19267.583     0.775000         5550         4.44
   19693.567     0.800000         5729         5.00
   20103.167     0.825000         5907         5.71
   20479.999     0.850000         6085         6.67
   20905.983     0.875000         6271         8.00
   21135.359     0.887500         6354         8.89
   21364.735     0.900000         6443        10.00
   21626.879     0.912500         6535        11.43
   21889.023     0.925000         6623        13.33
   22200.319     0.937500         6713        16.00
   22315.007     0.943750         6756        17.78
   22478.847     0.950000         6805        20.00
   22609.919     0.956250         6847        22.86
   22740.991     0.962500         6890        26.67
   23019.519     0.968750         6935        32.00
   23117.823     0.971875         6958        35.56
   23232.511     0.975000         6982        40.00
   23445.503     0.978125         7004        45.71
   23609.343     0.981250         7025        53.33
   23707.647     0.984375         7052        64.00
   23773.183     0.985938         7059        71.11
   23871.487     0.987500         7069        80.00
   23986.175     0.989062         7080        91.43
   24084.479     0.990625         7092       106.67
   24215.551     0.992188         7103       128.00
   24281.087     0.992969         7109       142.22
   24330.239     0.993750         7115       160.00
   24379.391     0.994531         7120       182.86
   24444.927     0.995313         7126       213.33
   24608.767     0.996094         7131       256.00
   24641.535     0.996484         7133       284.44
   24707.071     0.996875         7136       320.00
   24870.911     0.997266         7139       365.71
   24985.599     0.997656         7142       426.67
   25051.135     0.998047         7145       512.00
   25067.519     0.998242         7146       568.89
   25149.439     0.998437         7147       640.00
   25247.743     0.998633         7149       731.43
   25378.815     0.998828         7150       853.33
   25427.967     0.999023         7152      1024.00
   25427.967     0.999121         7152      1137.78
   25477.119     0.999219         7153      1280.00
   25575.423     0.999316         7154      1462.86
   25575.423     0.999414         7154      1706.67
   25657.343     0.999512         7155      2048.00
   25657.343     0.999561         7155      2275.56
   25722.879     0.999609         7156      2560.00
   25722.879     0.999658         7156      2925.71
   25722.879     0.999707         7156      3413.33
   25772.031     0.999756         7157      4096.00
   25772.031     0.999780         7157      4551.11
   25772.031     0.999805         7157      5120.00
   25772.031     0.999829         7157      5851.43
   25772.031     0.999854         7157      6826.67
   26247.167     0.999878         7158      8192.00
   26247.167     1.000000         7158          inf
#[Mean    =    15140.582, StdDeviation   =     4547.183]
#[Max     =    26230.784, Total count    =         7158]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  10484 requests in 30.03s, 2.19MB read
  Socket errors: connect 0, read 0, write 0, timeout 22
  Non-2xx or 3xx responses: 2144
Requests/sec:    349.09
Transfer/sec:     74.79KB